Voxelab-64/N32/Marlin/src/HAL/STM32F1/HAL.cpp
}


/**====================================================================================================================================================================
 *        n32g452 - end
====================================================================================================================================================================*/





// ------------------------
// ADC
// ------------------------
// Init the AD in continuous capture mode


#define NS_PINRT(V...)       do{ SERIAL_ECHO_START(); SERIAL_ECHOLNPAIR(V); }while(0)

// ------------------------
// ADC
// ------------------------
// Init the AD in continuous capture mode
void HAL_adc_init() 
{
  uint32_t reg_temp;

  // SERIAL_ECHO_MSG("\r\n n32g45x HAL_adc_init\r\n");

  /**  GPIO 设置 */
  reg_temp = ADC_RCC_APB2PCLKEN;
 	reg_temp |= 0x0f;                 //使能PORT口时钟 
  ADC_RCC_APB2PCLKEN = reg_temp;

  // reg_temp = NS_GPIOC_PL_CFG;
  // reg_temp &= 0XFF00FFFF;
  // NS_GPIOC_PL_CFG = reg_temp;       // PC4/5 anolog输入 
   
  enable_adc_clk(1);                // 使能ADC时钟
  ADC_DMA_init();                   // DMA初始化
  ADC_Initial(NS_ADC2);             // ADC初始化
  
  _delay_ms(2);
  // NS_PINRT("get adc1 = ", HAL_adc_results[0], "\r\n");
  // NS_PINRT("get adc2 = ", HAL_adc_results[1], "\r\n");
}

// void HAL_adc_init() 
// {

//   SERIAL_ECHO_MSG("\r\n n32g45x luke \r\n");

//   // configure the ADC
//   adc.calibrate();
//   #if F_CPU > 72000000
//     adc.setSampleRate(ADC_SMPR_71_5); // 71.5 ADC cycles
//   #else
//     adc.setSampleRate(ADC_SMPR_41_5); // 41.5 ADC cycles
//   #endif
//   adc.setPins((uint8_t *)adc_pins, ADC_PIN_COUNT);
//   adc.setDMA(HAL_adc_results, (uint16_t)ADC_PIN_COUNT, (uint32_t)(DMA_MINC_MODE | DMA_CIRC_MODE), nullptr);
//   adc.setScanMode();
//   adc.setContinuous();
//   adc.startConversion();
// }

void HAL_adc_start_conversion(const uint8_t adc_pin) {
  //TEMP_PINS pin_index;
  TempPinIndex pin_index;
  switch (adc_pin) {
    default: return;
    #if HAS_TEMP_ADC_0
      case TEMP_0_PIN: pin_index = TEMP_0; break;
    #endif
    #if HAS_TEMP_ADC_PROBE
      case TEMP_PROBE_PIN: pin_index = TEMP_PROBE; break;
    #endif
    #if HAS_HEATED_BED
      case TEMP_BED_PIN: pin_index = TEMP_BED; break;
    #endif
    #if HAS_TEMP_CHAMBER
      case TEMP_CHAMBER_PIN: pin_index = TEMP_CHAMBER; break;
    #endif
    #if HAS_TEMP_ADC_1
      case TEMP_1_PIN: pin_index = TEMP_1; break;
    #endif
    #if HAS_TEMP_ADC_2
      case TEMP_2_PIN: pin_index = TEMP_2; break;
    #endif
    #if HAS_TEMP_ADC_3
      case TEMP_3_PIN: pin_index = TEMP_3; break;
    #endif
    #if HAS_TEMP_ADC_4
      case TEMP_4_PIN: pin_index = TEMP_4; break;
    #endif
    #if HAS_TEMP_ADC_5
      case TEMP_5_PIN: pin_index = TEMP_5; break;
    #endif
    #if HAS_TEMP_ADC_6
      case TEMP_6_PIN: pin_index = TEMP_6; break;
    #endif
    #if HAS_TEMP_ADC_7
      case TEMP_7_PIN: pin_index = TEMP_7; break;
    #endif
    #if HAS_JOY_ADC_X
      case JOY_X_PIN: pin_index = JOY_X; break;
    #endif
    #if HAS_JOY_ADC_Y
      case JOY_Y_PIN: pin_index = JOY_Y; break;
    #endif
    #if HAS_JOY_ADC_Z
      case JOY_Z_PIN: pin_index = JOY_Z; break;
    #endif
    #if ENABLED(FILAMENT_WIDTH_SENSOR)
      case FILWIDTH_PIN: pin_index = FILWIDTH; break;
    #endif
    #if ENABLED(ADC_KEYPAD)
      case ADC_KEYPAD_PIN: pin_index = ADC_KEY; break;
    #endif
    #if ENABLED(POWER_MONITOR_CURRENT)
      case POWER_MONITOR_CURRENT_PIN: pin_index = POWERMON_CURRENT; break;
    #endif
    #if ENABLED(POWER_MONITOR_VOLTAGE)
      case POWER_MONITOR_VOLTAGE_PIN: pin_index = POWERMON_VOLTS; break;
    #endif
  }
  HAL_adc_result = (HAL_adc_results[(int)pin_index] >> 2) & 0x3FF; // shift to get 10 bits only.
  // NS_PINRT("adc=",HAL_adc_result);
}

uint16_t HAL_adc_get_result() { return HAL_adc_result; }

uint16_t analogRead(pin_t pin) {
  const bool is_analog = _GET_MODE(pin) == GPIO_INPUT_ANALOG;
  return is_analog ? analogRead(uint8_t(pin)) : 0;
}

// Wrapper to maple unprotected analogWrite
void analogWrite(pin_t pin, int pwm_val8) {
  if (PWM_PIN(pin))
    analogWrite(uint8_t(pin), pwm_val8);
}

void flashFirmware(const int16_t) { nvic_sys_reset(); }

#endif // __STM32F1__
